7767517
354 409
Input            data                             0 1 data
BinaryOp         underscorencnn_0_minusscalar0    1 1 data underscorencnn_0_minusscalar0 0=1 1=1 2=1.275000e+02
BinaryOp         underscorencnn_1_mulscalar0      1 1 underscorencnn_0_minusscalar0 underscorencnn_1_mulscalar0 0=2 1=1 2=7.812500e-03
Convolution      ghostnet0_convblock0_conv0_fwd   1 1 underscorencnn_1_mulscalar0 ghostnet0_convblock0_conv0_fwd 0=20 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=540
BatchNorm        ghostnet0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_convblock0_conv0_fwd ghostnet0_convblock0_batchnormextra0_fwd 0=20
ReLU             ghostnet0_convblock0_relu0_fwd   1 1 ghostnet0_convblock0_batchnormextra0_fwd ghostnet0_convblock0_relu0_fwd
ConvolutionDepthWise ghostnet0_convblock1_conv0_fwd   1 1 ghostnet0_convblock0_relu0_fwd ghostnet0_convblock1_conv0_fwd 0=20 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=180 7=20
BatchNorm        ghostnet0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_convblock1_conv0_fwd ghostnet0_convblock1_batchnormextra0_fwd 0=20
ReLU             ghostnet0_convblock1_relu0_fwd   1 1 ghostnet0_convblock1_batchnormextra0_fwd ghostnet0_convblock1_relu0_fwd
Split            splitncnn_0                      1 2 ghostnet0_convblock1_relu0_fwd ghostnet0_convblock1_relu0_fwd_splitncnn_0 ghostnet0_convblock1_relu0_fwd_splitncnn_1
Convolution      ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_convblock1_relu0_fwd_splitncnn_1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=200
BatchNorm        ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=10
ReLU             ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_1                      1 2 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=10 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=90 7=10
BatchNorm        ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=10
ReLU             ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 0=0
Convolution      ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=200
BatchNorm        ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=10
Split            splitncnn_2                      1 2 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=10 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=90 7=10
BatchNorm        ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=10
Concat           ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 0=0
BinaryOp         ghostnet0_stage1_ghostunit0__plus0 2 1 ghostnet0_stage1_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_convblock1_relu0_fwd_splitncnn_0 ghostnet0_stage1_ghostunit0__plus0 0=0
Split            splitncnn_3                      1 2 ghostnet0_stage1_ghostunit0__plus0 ghostnet0_stage1_ghostunit0__plus0_splitncnn_0 ghostnet0_stage1_ghostunit0__plus0_splitncnn_1
Convolution      ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage1_ghostunit0__plus0_splitncnn_1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=30 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=600
BatchNorm        ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=30
ReLU             ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_4                      1 2 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=30 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=270 7=30
BatchNorm        ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=30
ReLU             ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 0=0
ConvolutionDepthWise ghostnet0_stage2_ghostunit0_ghostexpblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage2_ghostunit0_ghostexpblock0_convblock0_conv0_fwd 0=60 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=540 7=60
BatchNorm        ghostnet0_stage2_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_convblock0_conv0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd 0=60
Convolution      ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=960
BatchNorm        ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=16
Split            splitncnn_5                      1 2 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=144 7=16
BatchNorm        ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=16
Concat           ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 0=0
ConvolutionDepthWise ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage1_ghostunit0__plus0_splitncnn_0 ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_conv0_fwd 0=20 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=180 7=20
BatchNorm        ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_conv0_fwd ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd 0=20
ReLU             ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_relu0_fwd
Convolution      ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock0_relu0_fwd ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock1_conv0_fwd 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=640
BatchNorm        ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock1_conv0_fwd ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd 0=32
BinaryOp         ghostnet0_stage2_ghostunit0__plus0 2 1 ghostnet0_stage2_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage2_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage2_ghostunit0__plus0 0=0
Split            splitncnn_6                      1 2 ghostnet0_stage2_ghostunit0__plus0 ghostnet0_stage2_ghostunit0__plus0_splitncnn_0 ghostnet0_stage2_ghostunit0__plus0_splitncnn_1
Convolution      ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage2_ghostunit0__plus0_splitncnn_1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1536
BatchNorm        ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=48
ReLU             ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_7                      1 2 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=432 7=48
BatchNorm        ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=48
ReLU             ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 0=0
Convolution      ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1536
BatchNorm        ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=16
Split            splitncnn_8                      1 2 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=144 7=16
BatchNorm        ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=16
Concat           ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 0=0
BinaryOp         ghostnet0_stage2_ghostunit1__plus0 2 1 ghostnet0_stage2_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage2_ghostunit0__plus0_splitncnn_0 ghostnet0_stage2_ghostunit1__plus0 0=0
Split            splitncnn_9                      1 2 ghostnet0_stage2_ghostunit1__plus0 ghostnet0_stage2_ghostunit1__plus0_splitncnn_0 ghostnet0_stage2_ghostunit1__plus0_splitncnn_1
Convolution      ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage2_ghostunit1__plus0_splitncnn_1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1536
BatchNorm        ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=48
ReLU             ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_10                     1 2 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=432 7=48
BatchNorm        ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=48
ReLU             ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 0=0
ConvolutionDepthWise ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_conv0_fwd 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 5=0 6=2400 7=96
BatchNorm        ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_conv0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd 0=96
Split            splitncnn_11                     1 2 ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd_splitncnn_1
Pooling          ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_pooling0 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_pooling0 0=1 4=1 5=1 6=0
Convolution      ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_pooling0 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_conv0_fwd 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2304
ReLU             ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_relu0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_conv0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_relu0_fwd
Convolution      ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_conv1_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_relu0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_conv1_fwd 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=2304
Clip             ghostnet0_stage3_ghostunit0_ghostexpblock0_ghosthsigmoid0_clip0 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_conv1_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghosthsigmoid0_clip0 0=0.000000e+00 1=1.000000e+00
BinaryOp         ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_broadcast_mul0 2 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghosthsigmoid0_clip0 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_broadcast_mul0 0=2
Convolution      ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_seblock0_broadcast_mul0 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=2496
BatchNorm        ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=26
Split            splitncnn_12                     1 2 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=234 7=26
BatchNorm        ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=26
Concat           ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 0=0
ConvolutionDepthWise ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage2_ghostunit1__plus0_splitncnn_0 ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_conv0_fwd 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=288 7=32
BatchNorm        ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_conv0_fwd ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd 0=32
ReLU             ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_relu0_fwd
Convolution      ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock0_relu0_fwd ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock1_conv0_fwd 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=1664
BatchNorm        ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock1_conv0_fwd ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd 0=52
BinaryOp         ghostnet0_stage3_ghostunit0__plus0 2 1 ghostnet0_stage3_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage3_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage3_ghostunit0__plus0 0=0
Split            splitncnn_13                     1 2 ghostnet0_stage3_ghostunit0__plus0 ghostnet0_stage3_ghostunit0__plus0_splitncnn_0 ghostnet0_stage3_ghostunit0__plus0_splitncnn_1
Convolution      ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit0__plus0_splitncnn_1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=78 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=4056
BatchNorm        ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=78
ReLU             ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_14                     1 2 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=78 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=702 7=78
BatchNorm        ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=78
ReLU             ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 0=0
Split            splitncnn_15                     1 2 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0_splitncnn_0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0_splitncnn_1
Pooling          ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_pooling0 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0_splitncnn_1 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_pooling0 0=1 4=1 5=1 6=0
Convolution      ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_pooling0 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_conv0_fwd 0=39 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6084
ReLU             ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_relu0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_conv0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_relu0_fwd
Convolution      ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_conv1_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_relu0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_conv1_fwd 0=156 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=1 6=6084
Clip             ghostnet0_stage3_ghostunit1_ghostexpblock0_ghosthsigmoid0_clip0 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_conv1_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghosthsigmoid0_clip0 0=0.000000e+00 1=1.000000e+00
BinaryOp         ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_broadcast_mul0 2 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock0_concat0_splitncnn_0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghosthsigmoid0_clip0 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_broadcast_mul0 0=2
Convolution      ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_seblock0_broadcast_mul0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=4056
BatchNorm        ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=26
Split            splitncnn_16                     1 2 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=234 7=26
BatchNorm        ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=26
Concat           ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 0=0
BinaryOp         ghostnet0_stage3_ghostunit1__plus0 2 1 ghostnet0_stage3_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage3_ghostunit0__plus0_splitncnn_0 ghostnet0_stage3_ghostunit1__plus0 0=0
Split            splitncnn_17                     1 2 ghostnet0_stage3_ghostunit1__plus0 ghostnet0_stage3_ghostunit1__plus0_splitncnn_0 ghostnet0_stage3_ghostunit1__plus0_splitncnn_1
Convolution      ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit1__plus0_splitncnn_1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=156 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=8112
BatchNorm        ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=156
ReLU             ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_18                     1 2 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=156 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1404 7=156
BatchNorm        ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=156
ReLU             ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 0=0
ConvolutionDepthWise ghostnet0_stage4_ghostunit0_ghostexpblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage4_ghostunit0_ghostexpblock0_convblock0_conv0_fwd 0=312 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=2808 7=312
BatchNorm        ghostnet0_stage4_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_convblock0_conv0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd 0=312
Convolution      ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=50 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=15600
BatchNorm        ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=50
Split            splitncnn_19                     1 2 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=50 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=450 7=50
BatchNorm        ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=50
Concat           ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 0=0
ConvolutionDepthWise ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage3_ghostunit1__plus0_splitncnn_0 ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_conv0_fwd 0=52 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=468 7=52
BatchNorm        ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_conv0_fwd ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd 0=52
ReLU             ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_relu0_fwd
Convolution      ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock0_relu0_fwd ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock1_conv0_fwd 0=100 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=5200
BatchNorm        ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock1_conv0_fwd ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd 0=100
BinaryOp         ghostnet0_stage4_ghostunit0__plus0 2 1 ghostnet0_stage4_ghostunit0_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage4_ghostunit0_dwsconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit0__plus0 0=0
Split            splitncnn_20                     1 2 ghostnet0_stage4_ghostunit0__plus0 ghostnet0_stage4_ghostunit0__plus0_splitncnn_0 ghostnet0_stage4_ghostunit0__plus0_splitncnn_1
Convolution      ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit0__plus0_splitncnn_1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=125 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=12500
BatchNorm        ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=125
ReLU             ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_21                     1 2 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=125 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1125 7=125
BatchNorm        ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=125
ReLU             ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 0=0
Convolution      ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=50 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=12500
BatchNorm        ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=50
Split            splitncnn_22                     1 2 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=50 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=450 7=50
BatchNorm        ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=50
Concat           ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 0=0
BinaryOp         ghostnet0_stage4_ghostunit1__plus0 2 1 ghostnet0_stage4_ghostunit1_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage4_ghostunit0__plus0_splitncnn_0 ghostnet0_stage4_ghostunit1__plus0 0=0
Split            splitncnn_23                     1 2 ghostnet0_stage4_ghostunit1__plus0 ghostnet0_stage4_ghostunit1__plus0_splitncnn_0 ghostnet0_stage4_ghostunit1__plus0_splitncnn_1
Convolution      ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit1__plus0_splitncnn_1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=115 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=11500
BatchNorm        ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=115
ReLU             ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_24                     1 2 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=115 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1035 7=115
BatchNorm        ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=115
ReLU             ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
Concat           ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_concat0 2 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_concat0 0=0
Convolution      ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock0_concat0 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd 0=50 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=11500
BatchNorm        ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_conv0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd 0=50
Split            splitncnn_25                     1 2 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd 0=50 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=450 7=50
BatchNorm        ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock1_conv0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd 0=50
Concat           ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_concat0 2 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock0_batchnormextra0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_concat0 0=0
BinaryOp         ghostnet0_stage4_ghostunit2__plus0 2 1 ghostnet0_stage4_ghostunit2_ghostexpblock0_ghostconvblock1_concat0 ghostnet0_stage4_ghostunit1__plus0_splitncnn_0 ghostnet0_stage4_ghostunit2__plus0 0=0
Split            splitncnn_26                     1 2 ghostnet0_stage4_ghostunit2__plus0 ghostnet0_stage4_ghostunit2__plus0_splitncnn_0 ghostnet0_stage4_ghostunit2__plus0_splitncnn_1
Convolution      ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 1 1 ghostnet0_stage4_ghostunit2__plus0_splitncnn_1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd 0=115 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 5=0 6=11500
BatchNorm        ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_conv0_fwd ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd 0=115
ReLU             ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd 1 1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_batchnormextra0_fwd ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd
Split            splitncnn_27                     1 2 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_0 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1
ConvolutionDepthWise ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 1 1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock0_relu0_fwd_splitncnn_1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd 0=115 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1035 7=115
BatchNorm        ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 1 1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_conv0_fwd ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd 0=115
ReLU             ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd 1 1 ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_batchnormextra0_fwd ghostnet0_stage4_ghostunit3_ghostexpblock0_ghostconvblock0_convblock1_relu0_fwd
