7767517
570 700
Input            data                             0 1 data
BinaryOp         underscorencnn_0_minusscalar0    1 1 data underscorencnn_0_minusscalar0 0=1 1=1 2=1.275000e+02
BinaryOp         underscorencnn_1_mulscalar0      1 1 underscorencnn_0_minusscalar0 underscorencnn_1_mulscalar0 0=2 1=1 2=7.812500e-03
Convolution      vargface_head_conv1              1 1 underscorencnn_1_mulscalar0 vargface_head_conv1 0=40 1=3 11=3 3=1 13=1 4=1 14=1 5=0 6=1080
BatchNorm        vargface_head_conv1_bn           1 1 vargface_head_conv1 vargface_head_conv1_bn 0=40
Split            splitncnn_0                      1 2 vargface_head_conv1_bn vargface_head_conv1_bn_splitncnn_0 vargface_head_conv1_bn_splitncnn_1
Sigmoid          vargface_head_conv1_act          1 1 vargface_head_conv1_bn_splitncnn_1 vargface_head_conv1_act
BinaryOp         underscorencnn_2_mul0            2 1 vargface_head_conv1_bn_splitncnn_0 vargface_head_conv1_act underscorencnn_2_mul0 0=2
Split            splitncnn_1                      1 2 underscorencnn_2_mul0 underscorencnn_2_mul0_splitncnn_0 underscorencnn_2_mul0_splitncnn_1
ConvolutionDepthWise vargface_head_head_pooling_sep1_data_conv2d_depthwise 1 1 underscorencnn_2_mul0_splitncnn_1 vargface_head_head_pooling_sep1_data_conv2d_depthwise 0=40 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=360 7=40
BatchNorm        vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn 1 1 vargface_head_head_pooling_sep1_data_conv2d_depthwise vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn 0=40
Split            splitncnn_2                      1 2 vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_head_head_pooling_sep1_data_conv2d_depthwise_act 1 1 vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_splitncnn_1 vargface_head_head_pooling_sep1_data_conv2d_depthwise_act
BinaryOp         underscorencnn_3_mul2            2 1 vargface_head_head_pooling_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_head_head_pooling_sep1_data_conv2d_depthwise_act underscorencnn_3_mul2 0=2
Convolution      vargface_head_head_pooling_sep1_data_conv2d_pointwise 1 1 underscorencnn_3_mul2 vargface_head_head_pooling_sep1_data_conv2d_pointwise 0=40 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=1600
BatchNorm        vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn 1 1 vargface_head_head_pooling_sep1_data_conv2d_pointwise vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn 0=40
Split            splitncnn_3                      1 2 vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_head_head_pooling_sep1_data_conv2d_pointwise_act 1 1 vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_splitncnn_1 vargface_head_head_pooling_sep1_data_conv2d_pointwise_act
BinaryOp         underscorencnn_4_mul3            2 1 vargface_head_head_pooling_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_head_head_pooling_sep1_data_conv2d_pointwise_act underscorencnn_4_mul3 0=2
ConvolutionDepthWise vargface_head_head_pooling_sep2_data_conv2d_depthwise 1 1 underscorencnn_4_mul3 vargface_head_head_pooling_sep2_data_conv2d_depthwise 0=40 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=360 7=40
BatchNorm        vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn 1 1 vargface_head_head_pooling_sep2_data_conv2d_depthwise vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn 0=40
Split            splitncnn_4                      1 2 vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_head_head_pooling_sep2_data_conv2d_depthwise_act 1 1 vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_head_head_pooling_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_5_mul4            2 1 vargface_head_head_pooling_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_head_head_pooling_sep2_data_conv2d_depthwise_act underscorencnn_5_mul4 0=2
Convolution      vargface_head_head_pooling_sep2_data_conv2d_pointwise 1 1 underscorencnn_5_mul4 vargface_head_head_pooling_sep2_data_conv2d_pointwise 0=40 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=1600
BatchNorm        vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn 1 1 vargface_head_head_pooling_sep2_data_conv2d_pointwise vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn 0=40
Split            splitncnn_5                      1 2 vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_splitncnn_1
Pooling          vargface_head_head_pooling_se_pool1 1 1 vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_splitncnn_1 vargface_head_head_pooling_se_pool1 0=1 4=1 5=1 6=0
Convolution      vargface_head_head_pooling_se_conv1 1 1 vargface_head_head_pooling_se_pool1 vargface_head_head_pooling_se_conv1 0=10 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=400
Split            splitncnn_6                      1 2 vargface_head_head_pooling_se_conv1 vargface_head_head_pooling_se_conv1_splitncnn_0 vargface_head_head_pooling_se_conv1_splitncnn_1
Sigmoid          vargface_head_head_pooling_se_act1 1 1 vargface_head_head_pooling_se_conv1_splitncnn_1 vargface_head_head_pooling_se_act1
BinaryOp         underscorencnn_6_mul5            2 1 vargface_head_head_pooling_se_conv1_splitncnn_0 vargface_head_head_pooling_se_act1 underscorencnn_6_mul5 0=2
Convolution      vargface_head_head_pooling_se_conv2 1 1 underscorencnn_6_mul5 vargface_head_head_pooling_se_conv2 0=40 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=400
Sigmoid          vargface_head_head_pooling_se_sigmoid 1 1 vargface_head_head_pooling_se_conv2 vargface_head_head_pooling_se_sigmoid
BinaryOp         broadcast_mul0                   2 1 vargface_head_head_pooling_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_head_head_pooling_se_sigmoid broadcast_mul0 0=2
Split            splitncnn_7                      1 3 broadcast_mul0 broadcast_mul0_splitncnn_0 broadcast_mul0_splitncnn_1 broadcast_mul0_splitncnn_2
Reduction        vargface_head_head_poolings_sa_mean 1 1 broadcast_mul0_splitncnn_2 vargface_head_head_poolings_sa_mean 0=3 1=1 4=1
Reduction        vargface_head_head_poolings_sa_max 1 1 broadcast_mul0_splitncnn_1 vargface_head_head_poolings_sa_max 0=4 1=1 4=1
Concat           vargface_head_head_poolings_sa_concat_body 2 1 vargface_head_head_poolings_sa_mean vargface_head_head_poolings_sa_max vargface_head_head_poolings_sa_concat_body 0=0
Convolution      vargface_head_head_poolings_sa_conv 1 1 vargface_head_head_poolings_sa_concat_body vargface_head_head_poolings_sa_conv 0=40 1=3 11=3 3=1 13=1 4=1 14=1 5=1 6=720
Sigmoid          vargface_head_head_poolings_sa_sigmoid 1 1 vargface_head_head_poolings_sa_conv vargface_head_head_poolings_sa_sigmoid
BinaryOp         broadcast_mul1                   2 1 broadcast_mul0_splitncnn_0 vargface_head_head_poolings_sa_sigmoid broadcast_mul1 0=2
ConvolutionDepthWise vargface_head_head_pooling_shortcut_conv2d_depthwise 1 1 underscorencnn_2_mul0_splitncnn_0 vargface_head_head_pooling_shortcut_conv2d_depthwise 0=40 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=360 7=40
BatchNorm        vargface_head_head_pooling_shortcut_conv2d_depthwise_bn 1 1 vargface_head_head_pooling_shortcut_conv2d_depthwise vargface_head_head_pooling_shortcut_conv2d_depthwise_bn 0=40
Split            splitncnn_8                      1 2 vargface_head_head_pooling_shortcut_conv2d_depthwise_bn vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_splitncnn_0 vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_head_head_pooling_shortcut_conv2d_depthwise_act 1 1 vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_splitncnn_1 vargface_head_head_pooling_shortcut_conv2d_depthwise_act
BinaryOp         underscorencnn_7_mul1            2 1 vargface_head_head_pooling_shortcut_conv2d_depthwise_bn_splitncnn_0 vargface_head_head_pooling_shortcut_conv2d_depthwise_act underscorencnn_7_mul1 0=2
Convolution      vargface_head_head_pooling_shortcut_conv2d_pointwise 1 1 underscorencnn_7_mul1 vargface_head_head_pooling_shortcut_conv2d_pointwise 0=40 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=1600
BatchNorm        vargface_head_head_pooling_shortcut_conv2d_pointwise_bn 1 1 vargface_head_head_pooling_shortcut_conv2d_pointwise vargface_head_head_pooling_shortcut_conv2d_pointwise_bn 0=40
BinaryOp         underscorencnn_8_plus0           2 1 broadcast_mul1 vargface_head_head_pooling_shortcut_conv2d_pointwise_bn underscorencnn_8_plus0 0=0
Split            splitncnn_9                      1 2 underscorencnn_8_plus0 underscorencnn_8_plus0_splitncnn_0 underscorencnn_8_plus0_splitncnn_1
Sigmoid          vargface_head_head_pooling_out_data_act 1 1 underscorencnn_8_plus0_splitncnn_1 vargface_head_head_pooling_out_data_act
BinaryOp         underscorencnn_9_mul6            2 1 underscorencnn_8_plus0_splitncnn_0 vargface_head_head_pooling_out_data_act underscorencnn_9_mul6 0=2
Split            splitncnn_10                     1 2 underscorencnn_9_mul6 underscorencnn_9_mul6_splitncnn_0 underscorencnn_9_mul6_splitncnn_1
ConvolutionDepthWise vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise 1 1 underscorencnn_9_mul6_splitncnn_1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise 0=80 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=720 7=40
BatchNorm        vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn 0=80
Split            splitncnn_11                     1 2 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_act 1 1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_act
BinaryOp         underscorencnn_10_mul8           2 1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_1_sep1_data_branch_conv2d_depthwise_act underscorencnn_10_mul8 0=2
Convolution      vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise 1 1 underscorencnn_10_mul8 vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=6400
BatchNorm        vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn 0=80
Split            splitncnn_12                     1 2 vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_1_sep1_data_act 1 1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_1 vargface_stage_2_unit_1_sep1_data_act
BinaryOp         underscorencnn_11_mul9           2 1 vargface_stage_2_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_1_sep1_data_act underscorencnn_11_mul9 0=2
ConvolutionDepthWise vargface_stage_2_unit_1_sep2_data_conv2d_depthwise 1 1 underscorencnn_11_mul9 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn 0=160
Split            splitncnn_13                     1 2 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_act 1 1 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_12_mul10          2 1 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_1_sep2_data_conv2d_depthwise_act underscorencnn_12_mul10 0=2
Convolution      vargface_stage_2_unit_1_sep2_data_conv2d_pointwise 1 1 underscorencnn_12_mul10 vargface_stage_2_unit_1_sep2_data_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=12800
BatchNorm        vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_1_sep2_data_conv2d_pointwise vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn 0=80
ConvolutionDepthWise vargface_stage_2_unit_1_shortcut_conv2d_depthwise 1 1 underscorencnn_9_mul6_splitncnn_0 vargface_stage_2_unit_1_shortcut_conv2d_depthwise 0=80 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=720 7=40
BatchNorm        vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_1_shortcut_conv2d_depthwise vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn 0=80
Split            splitncnn_14                     1 2 vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_1_shortcut_conv2d_depthwise_act 1 1 vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_1_shortcut_conv2d_depthwise_act
BinaryOp         underscorencnn_13_mul7           2 1 vargface_stage_2_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_1_shortcut_conv2d_depthwise_act underscorencnn_13_mul7 0=2
Convolution      vargface_stage_2_unit_1_shortcut_conv2d_pointwise 1 1 underscorencnn_13_mul7 vargface_stage_2_unit_1_shortcut_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=6400
BatchNorm        vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_1_shortcut_conv2d_pointwise vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn 0=80
BinaryOp         underscorencnn_14_plus1          2 1 vargface_stage_2_unit_1_sep2_data_conv2d_pointwise_bn vargface_stage_2_unit_1_shortcut_conv2d_pointwise_bn underscorencnn_14_plus1 0=0
Split            splitncnn_15                     1 2 underscorencnn_14_plus1 underscorencnn_14_plus1_splitncnn_0 underscorencnn_14_plus1_splitncnn_1
Sigmoid          vargface_stage_2_unit_1_out_data_act 1 1 underscorencnn_14_plus1_splitncnn_1 vargface_stage_2_unit_1_out_data_act
BinaryOp         underscorencnn_15_mul11          2 1 underscorencnn_14_plus1_splitncnn_0 vargface_stage_2_unit_1_out_data_act underscorencnn_15_mul11 0=2
Split            splitncnn_16                     1 2 underscorencnn_15_mul11 underscorencnn_15_mul11_splitncnn_0 underscorencnn_15_mul11_splitncnn_1
ConvolutionDepthWise vargface_stage_2_unit_2_sep1_data_conv2d_depthwise 1 1 underscorencnn_15_mul11_splitncnn_1 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn 0=160
Split            splitncnn_17                     1 2 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_act 1 1 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_act
BinaryOp         underscorencnn_16_mul12          2 1 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep1_data_conv2d_depthwise_act underscorencnn_16_mul12 0=2
Convolution      vargface_stage_2_unit_2_sep1_data_conv2d_pointwise 1 1 underscorencnn_16_mul12 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=12800
BatchNorm        vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn 0=80
Split            splitncnn_18                     1 2 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_act 1 1 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_act
BinaryOp         underscorencnn_17_mul13          2 1 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep1_data_conv2d_pointwise_act underscorencnn_17_mul13 0=2
ConvolutionDepthWise vargface_stage_2_unit_2_sep2_data_conv2d_depthwise 1 1 underscorencnn_17_mul13 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn 0=160
Split            splitncnn_19                     1 2 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_act 1 1 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_18_mul14          2 1 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep2_data_conv2d_depthwise_act underscorencnn_18_mul14 0=2
Convolution      vargface_stage_2_unit_2_sep2_data_conv2d_pointwise 1 1 underscorencnn_18_mul14 vargface_stage_2_unit_2_sep2_data_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=12800
BatchNorm        vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_2_sep2_data_conv2d_pointwise vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn 0=80
Split            splitncnn_20                     1 2 vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_1
Pooling          vargface_stage_2_unit_2_se_pool1 1 1 vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_2_unit_2_se_pool1 0=1 4=1 5=1 6=0
Convolution      vargface_stage_2_unit_2_se_conv1 1 1 vargface_stage_2_unit_2_se_pool1 vargface_stage_2_unit_2_se_conv1 0=20 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=1600
Split            splitncnn_21                     1 2 vargface_stage_2_unit_2_se_conv1 vargface_stage_2_unit_2_se_conv1_splitncnn_0 vargface_stage_2_unit_2_se_conv1_splitncnn_1
Sigmoid          vargface_stage_2_unit_2_se_act1  1 1 vargface_stage_2_unit_2_se_conv1_splitncnn_1 vargface_stage_2_unit_2_se_act1
BinaryOp         underscorencnn_19_mul15          2 1 vargface_stage_2_unit_2_se_conv1_splitncnn_0 vargface_stage_2_unit_2_se_act1 underscorencnn_19_mul15 0=2
Convolution      vargface_stage_2_unit_2_se_conv2 1 1 underscorencnn_19_mul15 vargface_stage_2_unit_2_se_conv2 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=1600
Sigmoid          vargface_stage_2_unit_2_se_sigmoid 1 1 vargface_stage_2_unit_2_se_conv2 vargface_stage_2_unit_2_se_sigmoid
BinaryOp         broadcast_mul2                   2 1 vargface_stage_2_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_2_se_sigmoid broadcast_mul2 0=2
Split            splitncnn_22                     1 3 broadcast_mul2 broadcast_mul2_splitncnn_0 broadcast_mul2_splitncnn_1 broadcast_mul2_splitncnn_2
Reduction        vargface_stage_2_unit_2s_sa_mean 1 1 broadcast_mul2_splitncnn_2 vargface_stage_2_unit_2s_sa_mean 0=3 1=1 4=1
Reduction        vargface_stage_2_unit_2s_sa_max  1 1 broadcast_mul2_splitncnn_1 vargface_stage_2_unit_2s_sa_max 0=4 1=1 4=1
Concat           vargface_stage_2_unit_2s_sa_concat_body 2 1 vargface_stage_2_unit_2s_sa_mean vargface_stage_2_unit_2s_sa_max vargface_stage_2_unit_2s_sa_concat_body 0=0
Convolution      vargface_stage_2_unit_2s_sa_conv 1 1 vargface_stage_2_unit_2s_sa_concat_body vargface_stage_2_unit_2s_sa_conv 0=80 1=3 11=3 3=1 13=1 4=1 14=1 5=1 6=1440
Sigmoid          vargface_stage_2_unit_2s_sa_sigmoid 1 1 vargface_stage_2_unit_2s_sa_conv vargface_stage_2_unit_2s_sa_sigmoid
BinaryOp         broadcast_mul3                   2 1 broadcast_mul2_splitncnn_0 vargface_stage_2_unit_2s_sa_sigmoid broadcast_mul3 0=2
BinaryOp         underscorencnn_20_plus2          2 1 broadcast_mul3 underscorencnn_15_mul11_splitncnn_0 underscorencnn_20_plus2 0=0
Split            splitncnn_23                     1 2 underscorencnn_20_plus2 underscorencnn_20_plus2_splitncnn_0 underscorencnn_20_plus2_splitncnn_1
Sigmoid          vargface_stage_2_unit_2_out_data_act 1 1 underscorencnn_20_plus2_splitncnn_1 vargface_stage_2_unit_2_out_data_act
BinaryOp         underscorencnn_21_mul16          2 1 underscorencnn_20_plus2_splitncnn_0 vargface_stage_2_unit_2_out_data_act underscorencnn_21_mul16 0=2
Split            splitncnn_24                     1 2 underscorencnn_21_mul16 underscorencnn_21_mul16_splitncnn_0 underscorencnn_21_mul16_splitncnn_1
ConvolutionDepthWise vargface_stage_2_unit_3_sep1_data_conv2d_depthwise 1 1 underscorencnn_21_mul16_splitncnn_1 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn 0=160
Split            splitncnn_25                     1 2 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_act 1 1 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_act
BinaryOp         underscorencnn_22_mul17          2 1 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep1_data_conv2d_depthwise_act underscorencnn_22_mul17 0=2
Convolution      vargface_stage_2_unit_3_sep1_data_conv2d_pointwise 1 1 underscorencnn_22_mul17 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=12800
BatchNorm        vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn 0=80
Split            splitncnn_26                     1 2 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_act 1 1 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_act
BinaryOp         underscorencnn_23_mul18          2 1 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep1_data_conv2d_pointwise_act underscorencnn_23_mul18 0=2
ConvolutionDepthWise vargface_stage_2_unit_3_sep2_data_conv2d_depthwise 1 1 underscorencnn_23_mul18 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn 1 1 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn 0=160
Split            splitncnn_27                     1 2 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_act 1 1 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_24_mul19          2 1 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep2_data_conv2d_depthwise_act underscorencnn_24_mul19 0=2
Convolution      vargface_stage_2_unit_3_sep2_data_conv2d_pointwise 1 1 underscorencnn_24_mul19 vargface_stage_2_unit_3_sep2_data_conv2d_pointwise 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=12800
BatchNorm        vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn 1 1 vargface_stage_2_unit_3_sep2_data_conv2d_pointwise vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn 0=80
Split            splitncnn_28                     1 2 vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_1
Pooling          vargface_stage_2_unit_3_se_pool1 1 1 vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_2_unit_3_se_pool1 0=1 4=1 5=1 6=0
Convolution      vargface_stage_2_unit_3_se_conv1 1 1 vargface_stage_2_unit_3_se_pool1 vargface_stage_2_unit_3_se_conv1 0=20 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=1600
Split            splitncnn_29                     1 2 vargface_stage_2_unit_3_se_conv1 vargface_stage_2_unit_3_se_conv1_splitncnn_0 vargface_stage_2_unit_3_se_conv1_splitncnn_1
Sigmoid          vargface_stage_2_unit_3_se_act1  1 1 vargface_stage_2_unit_3_se_conv1_splitncnn_1 vargface_stage_2_unit_3_se_act1
BinaryOp         underscorencnn_25_mul20          2 1 vargface_stage_2_unit_3_se_conv1_splitncnn_0 vargface_stage_2_unit_3_se_act1 underscorencnn_25_mul20 0=2
Convolution      vargface_stage_2_unit_3_se_conv2 1 1 underscorencnn_25_mul20 vargface_stage_2_unit_3_se_conv2 0=80 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=1600
Sigmoid          vargface_stage_2_unit_3_se_sigmoid 1 1 vargface_stage_2_unit_3_se_conv2 vargface_stage_2_unit_3_se_sigmoid
BinaryOp         broadcast_mul4                   2 1 vargface_stage_2_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_2_unit_3_se_sigmoid broadcast_mul4 0=2
Split            splitncnn_30                     1 3 broadcast_mul4 broadcast_mul4_splitncnn_0 broadcast_mul4_splitncnn_1 broadcast_mul4_splitncnn_2
Reduction        vargface_stage_2_unit_3s_sa_mean 1 1 broadcast_mul4_splitncnn_2 vargface_stage_2_unit_3s_sa_mean 0=3 1=1 4=1
Reduction        vargface_stage_2_unit_3s_sa_max  1 1 broadcast_mul4_splitncnn_1 vargface_stage_2_unit_3s_sa_max 0=4 1=1 4=1
Concat           vargface_stage_2_unit_3s_sa_concat_body 2 1 vargface_stage_2_unit_3s_sa_mean vargface_stage_2_unit_3s_sa_max vargface_stage_2_unit_3s_sa_concat_body 0=0
Convolution      vargface_stage_2_unit_3s_sa_conv 1 1 vargface_stage_2_unit_3s_sa_concat_body vargface_stage_2_unit_3s_sa_conv 0=80 1=3 11=3 3=1 13=1 4=1 14=1 5=1 6=1440
Sigmoid          vargface_stage_2_unit_3s_sa_sigmoid 1 1 vargface_stage_2_unit_3s_sa_conv vargface_stage_2_unit_3s_sa_sigmoid
BinaryOp         broadcast_mul5                   2 1 broadcast_mul4_splitncnn_0 vargface_stage_2_unit_3s_sa_sigmoid broadcast_mul5 0=2
BinaryOp         underscorencnn_26_plus3          2 1 broadcast_mul5 underscorencnn_21_mul16_splitncnn_0 underscorencnn_26_plus3 0=0
Split            splitncnn_31                     1 2 underscorencnn_26_plus3 underscorencnn_26_plus3_splitncnn_0 underscorencnn_26_plus3_splitncnn_1
Sigmoid          vargface_stage_2_unit_3_out_data_act 1 1 underscorencnn_26_plus3_splitncnn_1 vargface_stage_2_unit_3_out_data_act
BinaryOp         underscorencnn_27_mul21          2 1 underscorencnn_26_plus3_splitncnn_0 vargface_stage_2_unit_3_out_data_act underscorencnn_27_mul21 0=2
Split            splitncnn_32                     1 2 underscorencnn_27_mul21 underscorencnn_27_mul21_splitncnn_0 underscorencnn_27_mul21_splitncnn_1
ConvolutionDepthWise vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise 1 1 underscorencnn_27_mul21_splitncnn_1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn 0=160
Split            splitncnn_33                     1 2 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_act 1 1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_act
BinaryOp         underscorencnn_28_mul23          2 1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_1_sep1_data_branch_conv2d_depthwise_act underscorencnn_28_mul23 0=2
Convolution      vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise 1 1 underscorencnn_28_mul23 vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=25600
BatchNorm        vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn 0=160
Split            splitncnn_34                     1 2 vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_1_sep1_data_act 1 1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_1 vargface_stage_3_unit_1_sep1_data_act
BinaryOp         underscorencnn_29_mul24          2 1 vargface_stage_3_unit_1_sep1_data_branch_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_1_sep1_data_act underscorencnn_29_mul24 0=2
ConvolutionDepthWise vargface_stage_3_unit_1_sep2_data_conv2d_depthwise 1 1 underscorencnn_29_mul24 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2880 7=160
BatchNorm        vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn 0=320
Split            splitncnn_35                     1 2 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_act 1 1 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_30_mul25          2 1 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_1_sep2_data_conv2d_depthwise_act underscorencnn_30_mul25 0=2
Convolution      vargface_stage_3_unit_1_sep2_data_conv2d_pointwise 1 1 underscorencnn_30_mul25 vargface_stage_3_unit_1_sep2_data_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=51200
BatchNorm        vargface_stage_3_unit_1_sep2_data_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_1_sep2_data_conv2d_pointwise vargface_stage_3_unit_1_sep2_data_conv2d_pointwise_bn 0=160
ConvolutionDepthWise vargface_stage_3_unit_1_shortcut_conv2d_depthwise 1 1 underscorencnn_27_mul21_splitncnn_0 vargface_stage_3_unit_1_shortcut_conv2d_depthwise 0=160 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 5=0 6=1440 7=80
BatchNorm        vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_1_shortcut_conv2d_depthwise vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn 0=160
Split            splitncnn_36                     1 2 vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_1_shortcut_conv2d_depthwise_act 1 1 vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_1_shortcut_conv2d_depthwise_act
BinaryOp         underscorencnn_31_mul22          2 1 vargface_stage_3_unit_1_shortcut_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_1_shortcut_conv2d_depthwise_act underscorencnn_31_mul22 0=2
Convolution      vargface_stage_3_unit_1_shortcut_conv2d_pointwise 1 1 underscorencnn_31_mul22 vargface_stage_3_unit_1_shortcut_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=25600
BatchNorm        vargface_stage_3_unit_1_shortcut_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_1_shortcut_conv2d_pointwise vargface_stage_3_unit_1_shortcut_conv2d_pointwise_bn 0=160
BinaryOp         underscorencnn_32_plus4          2 1 vargface_stage_3_unit_1_sep2_data_conv2d_pointwise_bn vargface_stage_3_unit_1_shortcut_conv2d_pointwise_bn underscorencnn_32_plus4 0=0
Split            splitncnn_37                     1 2 underscorencnn_32_plus4 underscorencnn_32_plus4_splitncnn_0 underscorencnn_32_plus4_splitncnn_1
Sigmoid          vargface_stage_3_unit_1_out_data_act 1 1 underscorencnn_32_plus4_splitncnn_1 vargface_stage_3_unit_1_out_data_act
BinaryOp         underscorencnn_33_mul26          2 1 underscorencnn_32_plus4_splitncnn_0 vargface_stage_3_unit_1_out_data_act underscorencnn_33_mul26 0=2
Split            splitncnn_38                     1 2 underscorencnn_33_mul26 underscorencnn_33_mul26_splitncnn_0 underscorencnn_33_mul26_splitncnn_1
ConvolutionDepthWise vargface_stage_3_unit_2_sep1_data_conv2d_depthwise 1 1 underscorencnn_33_mul26_splitncnn_1 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2880 7=160
BatchNorm        vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn 0=320
Split            splitncnn_39                     1 2 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_act 1 1 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_act
BinaryOp         underscorencnn_34_mul27          2 1 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep1_data_conv2d_depthwise_act underscorencnn_34_mul27 0=2
Convolution      vargface_stage_3_unit_2_sep1_data_conv2d_pointwise 1 1 underscorencnn_34_mul27 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=51200
BatchNorm        vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn 0=160
Split            splitncnn_40                     1 2 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_act 1 1 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_act
BinaryOp         underscorencnn_35_mul28          2 1 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep1_data_conv2d_pointwise_act underscorencnn_35_mul28 0=2
ConvolutionDepthWise vargface_stage_3_unit_2_sep2_data_conv2d_depthwise 1 1 underscorencnn_35_mul28 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2880 7=160
BatchNorm        vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn 0=320
Split            splitncnn_41                     1 2 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_act 1 1 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_36_mul29          2 1 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep2_data_conv2d_depthwise_act underscorencnn_36_mul29 0=2
Convolution      vargface_stage_3_unit_2_sep2_data_conv2d_pointwise 1 1 underscorencnn_36_mul29 vargface_stage_3_unit_2_sep2_data_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=51200
BatchNorm        vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_2_sep2_data_conv2d_pointwise vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn 0=160
Split            splitncnn_42                     1 2 vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_1
Pooling          vargface_stage_3_unit_2_se_pool1 1 1 vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_3_unit_2_se_pool1 0=1 4=1 5=1 6=0
Convolution      vargface_stage_3_unit_2_se_conv1 1 1 vargface_stage_3_unit_2_se_pool1 vargface_stage_3_unit_2_se_conv1 0=40 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=6400
Split            splitncnn_43                     1 2 vargface_stage_3_unit_2_se_conv1 vargface_stage_3_unit_2_se_conv1_splitncnn_0 vargface_stage_3_unit_2_se_conv1_splitncnn_1
Sigmoid          vargface_stage_3_unit_2_se_act1  1 1 vargface_stage_3_unit_2_se_conv1_splitncnn_1 vargface_stage_3_unit_2_se_act1
BinaryOp         underscorencnn_37_mul30          2 1 vargface_stage_3_unit_2_se_conv1_splitncnn_0 vargface_stage_3_unit_2_se_act1 underscorencnn_37_mul30 0=2
Convolution      vargface_stage_3_unit_2_se_conv2 1 1 underscorencnn_37_mul30 vargface_stage_3_unit_2_se_conv2 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=6400
Sigmoid          vargface_stage_3_unit_2_se_sigmoid 1 1 vargface_stage_3_unit_2_se_conv2 vargface_stage_3_unit_2_se_sigmoid
BinaryOp         broadcast_mul6                   2 1 vargface_stage_3_unit_2_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_2_se_sigmoid broadcast_mul6 0=2
Split            splitncnn_44                     1 3 broadcast_mul6 broadcast_mul6_splitncnn_0 broadcast_mul6_splitncnn_1 broadcast_mul6_splitncnn_2
Reduction        vargface_stage_3_unit_2s_sa_mean 1 1 broadcast_mul6_splitncnn_2 vargface_stage_3_unit_2s_sa_mean 0=3 1=1 4=1
Reduction        vargface_stage_3_unit_2s_sa_max  1 1 broadcast_mul6_splitncnn_1 vargface_stage_3_unit_2s_sa_max 0=4 1=1 4=1
Concat           vargface_stage_3_unit_2s_sa_concat_body 2 1 vargface_stage_3_unit_2s_sa_mean vargface_stage_3_unit_2s_sa_max vargface_stage_3_unit_2s_sa_concat_body 0=0
Convolution      vargface_stage_3_unit_2s_sa_conv 1 1 vargface_stage_3_unit_2s_sa_concat_body vargface_stage_3_unit_2s_sa_conv 0=160 1=3 11=3 3=1 13=1 4=1 14=1 5=1 6=2880
Sigmoid          vargface_stage_3_unit_2s_sa_sigmoid 1 1 vargface_stage_3_unit_2s_sa_conv vargface_stage_3_unit_2s_sa_sigmoid
BinaryOp         broadcast_mul7                   2 1 broadcast_mul6_splitncnn_0 vargface_stage_3_unit_2s_sa_sigmoid broadcast_mul7 0=2
BinaryOp         underscorencnn_38_plus5          2 1 broadcast_mul7 underscorencnn_33_mul26_splitncnn_0 underscorencnn_38_plus5 0=0
Split            splitncnn_45                     1 2 underscorencnn_38_plus5 underscorencnn_38_plus5_splitncnn_0 underscorencnn_38_plus5_splitncnn_1
Sigmoid          vargface_stage_3_unit_2_out_data_act 1 1 underscorencnn_38_plus5_splitncnn_1 vargface_stage_3_unit_2_out_data_act
BinaryOp         underscorencnn_39_mul31          2 1 underscorencnn_38_plus5_splitncnn_0 vargface_stage_3_unit_2_out_data_act underscorencnn_39_mul31 0=2
Split            splitncnn_46                     1 2 underscorencnn_39_mul31 underscorencnn_39_mul31_splitncnn_0 underscorencnn_39_mul31_splitncnn_1
ConvolutionDepthWise vargface_stage_3_unit_3_sep1_data_conv2d_depthwise 1 1 underscorencnn_39_mul31_splitncnn_1 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2880 7=160
BatchNorm        vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn 0=320
Split            splitncnn_47                     1 2 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_act 1 1 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_act
BinaryOp         underscorencnn_40_mul32          2 1 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep1_data_conv2d_depthwise_act underscorencnn_40_mul32 0=2
Convolution      vargface_stage_3_unit_3_sep1_data_conv2d_pointwise 1 1 underscorencnn_40_mul32 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=51200
BatchNorm        vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn 0=160
Split            splitncnn_48                     1 2 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_act 1 1 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_act
BinaryOp         underscorencnn_41_mul33          2 1 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep1_data_conv2d_pointwise_act underscorencnn_41_mul33 0=2
ConvolutionDepthWise vargface_stage_3_unit_3_sep2_data_conv2d_depthwise 1 1 underscorencnn_41_mul33 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2880 7=160
BatchNorm        vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn 0=320
Split            splitncnn_49                     1 2 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_act 1 1 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_act
BinaryOp         underscorencnn_42_mul34          2 1 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep2_data_conv2d_depthwise_act underscorencnn_42_mul34 0=2
Convolution      vargface_stage_3_unit_3_sep2_data_conv2d_pointwise 1 1 underscorencnn_42_mul34 vargface_stage_3_unit_3_sep2_data_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=51200
BatchNorm        vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_3_sep2_data_conv2d_pointwise vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn 0=160
Split            splitncnn_50                     1 2 vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_1
Pooling          vargface_stage_3_unit_3_se_pool1 1 1 vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_3_unit_3_se_pool1 0=1 4=1 5=1 6=0
Convolution      vargface_stage_3_unit_3_se_conv1 1 1 vargface_stage_3_unit_3_se_pool1 vargface_stage_3_unit_3_se_conv1 0=40 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=6400
Split            splitncnn_51                     1 2 vargface_stage_3_unit_3_se_conv1 vargface_stage_3_unit_3_se_conv1_splitncnn_0 vargface_stage_3_unit_3_se_conv1_splitncnn_1
Sigmoid          vargface_stage_3_unit_3_se_act1  1 1 vargface_stage_3_unit_3_se_conv1_splitncnn_1 vargface_stage_3_unit_3_se_act1
BinaryOp         underscorencnn_43_mul35          2 1 vargface_stage_3_unit_3_se_conv1_splitncnn_0 vargface_stage_3_unit_3_se_act1 underscorencnn_43_mul35 0=2
Convolution      vargface_stage_3_unit_3_se_conv2 1 1 underscorencnn_43_mul35 vargface_stage_3_unit_3_se_conv2 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=1 6=6400
Sigmoid          vargface_stage_3_unit_3_se_sigmoid 1 1 vargface_stage_3_unit_3_se_conv2 vargface_stage_3_unit_3_se_sigmoid
BinaryOp         broadcast_mul8                   2 1 vargface_stage_3_unit_3_sep2_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_3_se_sigmoid broadcast_mul8 0=2
Split            splitncnn_52                     1 3 broadcast_mul8 broadcast_mul8_splitncnn_0 broadcast_mul8_splitncnn_1 broadcast_mul8_splitncnn_2
Reduction        vargface_stage_3_unit_3s_sa_mean 1 1 broadcast_mul8_splitncnn_2 vargface_stage_3_unit_3s_sa_mean 0=3 1=1 4=1
Reduction        vargface_stage_3_unit_3s_sa_max  1 1 broadcast_mul8_splitncnn_1 vargface_stage_3_unit_3s_sa_max 0=4 1=1 4=1
Concat           vargface_stage_3_unit_3s_sa_concat_body 2 1 vargface_stage_3_unit_3s_sa_mean vargface_stage_3_unit_3s_sa_max vargface_stage_3_unit_3s_sa_concat_body 0=0
Convolution      vargface_stage_3_unit_3s_sa_conv 1 1 vargface_stage_3_unit_3s_sa_concat_body vargface_stage_3_unit_3s_sa_conv 0=160 1=3 11=3 3=1 13=1 4=1 14=1 5=1 6=2880
Sigmoid          vargface_stage_3_unit_3s_sa_sigmoid 1 1 vargface_stage_3_unit_3s_sa_conv vargface_stage_3_unit_3s_sa_sigmoid
BinaryOp         broadcast_mul9                   2 1 broadcast_mul8_splitncnn_0 vargface_stage_3_unit_3s_sa_sigmoid broadcast_mul9 0=2
BinaryOp         underscorencnn_44_plus6          2 1 broadcast_mul9 underscorencnn_39_mul31_splitncnn_0 underscorencnn_44_plus6 0=0
Split            splitncnn_53                     1 2 underscorencnn_44_plus6 underscorencnn_44_plus6_splitncnn_0 underscorencnn_44_plus6_splitncnn_1
Sigmoid          vargface_stage_3_unit_3_out_data_act 1 1 underscorencnn_44_plus6_splitncnn_1 vargface_stage_3_unit_3_out_data_act
BinaryOp         underscorencnn_45_mul36          2 1 underscorencnn_44_plus6_splitncnn_0 vargface_stage_3_unit_3_out_data_act underscorencnn_45_mul36 0=2
Split            splitncnn_54                     1 2 underscorencnn_45_mul36 underscorencnn_45_mul36_splitncnn_0 underscorencnn_45_mul36_splitncnn_1
ConvolutionDepthWise vargface_stage_3_unit_4_sep1_data_conv2d_depthwise 1 1 underscorencnn_45_mul36_splitncnn_1 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 5=0 6=2880 7=160
BatchNorm        vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn 1 1 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn 0=320
Split            splitncnn_55                     1 2 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_act 1 1 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn_splitncnn_1 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_act
BinaryOp         underscorencnn_46_mul37          2 1 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_bn_splitncnn_0 vargface_stage_3_unit_4_sep1_data_conv2d_depthwise_act underscorencnn_46_mul37 0=2
Convolution      vargface_stage_3_unit_4_sep1_data_conv2d_pointwise 1 1 underscorencnn_46_mul37 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise 0=160 1=1 11=1 3=1 13=1 4=0 14=0 5=0 6=51200
BatchNorm        vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn 1 1 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn 0=160
Split            splitncnn_56                     1 2 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn_splitncnn_1
Sigmoid          vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_act 1 1 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn_splitncnn_1 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_act
BinaryOp         underscorencnn_47_mul38          2 1 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_bn_splitncnn_0 vargface_stage_3_unit_4_sep1_data_conv2d_pointwise_act underscorencnn_47_mul38 0=2
